#chapter 1
varp<-function(x){
	標本分散<-var(x)*(length(x)-1)/length(x)
	標本分散
}
x<-c(10,13,8,15,8)
var(x)
varp(x)

#chapter 17
library(sem)

#協調性<-read.moments(names=c("y1","y2","y3","y4","y5","y6","y7","y8","y9","y10","y11","y12"))
協調性<-readMoments(diag=FALSE,names=as.character(paste("y",1:13,sep="")))
1.00
.160 1.000
.302 .341 1.000
.461 .400 .372 1.000
.2999 .404 .552 .302 1.000
.152 .320 .476 .255 .708 1.000
.134 .403 .467 .256 .623 .324 1.000
.182 .374 .572 .255 .776 .769 .724 1.000
.251 .285 .316 .164 .361 .295 .260 .284 1.000
.372 .100 .408 .236 .294 .206 .071 .142 .295 1.000
.157 .291 .393 .229 .472 .351 .204 .320 .290 .468 1.000
.206 -.014 .369 .224 .342 .202 .152 .189 .418 .351 .385 1.000

model.協調性<-specify.model()
母親価値 -> y1,b11,NA
母親価値 -> y2,b21,NA
母親価値 -> y3,b31,NA
母親価値 -> y4,b41,NA
相互作用経験 -> y5,NA,1
相互作用経験 -> y6,b62,NA
相互作用経験 -> y7,b72,NA
相互作用経験 -> y8,b82,NA
協調性->y9,NA,1
協調性->y10,b103,NA
協調性->y11,b113,NA
協調性->y12,b123,NA
母親価値->相互作用経験,g21,NA
母親価値->協調性,g31,NA
y1<->y1,e1,NA
y2<->y2,e2,NA
y3<->y3,e3,NA
y4<->y4,e4,NA
y5<->y5,e5,NA
y6<->y6,e6,NA
y7<->y7,e7,NA
y8<->y8,e8,NA
y9<->y9,e9,NA
y10<->y10,e10,NA
y11<->y11,e11,NA
y12<->y12,e12,NA
母親価値<->母親価値,NA,1
相互作用経験<->相互作用経験,delta2,NA
協調性<->協調性,delta3,NA

(sem.協調性<-sem(model.協調性,協調性,N=50))
(summary(sem.協調性))
