#因子分析の宿題のＳＤデータを作成するための関数
#入力は、概念の文字ベクトル
#オズグッドの評価と活動性を3変数ずつで測定しＳＤデータを作成する。
#ＳＤデータは、ＷＤに"因子分析宿題データ.csv"というファイル名で保存される。
因子分析宿題データ作成<-function(概念){
   概念数<-length(概念)
   尺度数<-6
   件数<-5
   尺度<-matrix(c(
      "とても好きな","やや好きな","どちらでもない","やや嫌いな","とても嫌いな",
      "とても暗い",  "やや暗い",  "どちらでもない","やや明るい","とても明るい",
      "とても野暮な","やや野暮な","どちらでもない","やや洒落た","とても洒落た",
      "とても動的な","やや動的な","どちらでもない","やや静的な","とても静的な",
      "とても美しい","やや美しい","どちらでもない","やや汚れた","とても汚れた",
      "とても強い",  "やや強い",  "どちらでもない","やや弱い",  "とても弱い"),
          尺度数,件数,byrow =T)
   sdd<-matrix(0,概念数,尺度数)
   for (i in 1:概念数){
      for (j in 1:尺度数){
         sdd[i,j]<-menu(尺度[j,], graphics = F, 
            title = paste(概念[i],"の印象は？",sep=""))
      }
   }
   sdd<-as.data.frame(sdd)
   sdd<-cbind(概念,sdd)
   colnames(sdd)<-c("概念","嫌いな","明るい","洒落た","静的な","汚れた","弱い")
   print(sdd)
   write.table(sdd,"因子分析宿題データ.csv",sep=",",row.names=F)
}
